Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes Class
 The CurvedDimensionSetBaseAttributes class contains the attributes for the curved dimensions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class CurvedDimensionSetBaseAttributes : DimensionSetBaseAttributes
<SerializableAttribute>
Public MustInherit Class CurvedDimensionSetBaseAttributes
	Inherits DimensionSetBaseAttributes
The CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes type exposes the following members.
Constructors
Name | Description
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes()
 Creates a new curved dimension set base attributes instance which loads standard attributes.
CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes(String)
 Creates a new curved dimension set base attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Color
 The color of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Format
 The format attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Placing
 The placing attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Text
 The text attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
TransparentBackground
 The dimension text background transparency. (transparent/opaque)
 (Inherited from DimensionSetBaseAttributes.)
TrueColor
 The true color (RGB enabled) of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from AttributesBase.)
LoadAttributes
 Loads the attributes from the specified file.
 (Inherited from AttributesBase.)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace